{"class_name": "Sequential", "keras_version": "2.3.1", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 32, "strides": [1, 1], "name": "conv2d_43", "activity_regularizer": null, "activation": "elu", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 32, "strides": [1, 1], "name": "conv2d_44", "activity_regularizer": null, "activation": "elu", "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_22", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "dtype": "float32", "noise_shape": null, "rate": 0.2, "name": "dropout_22", "seed": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 64, "strides": [1, 1], "name": "conv2d_45", "activity_regularizer": null, "activation": "elu", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 64, "strides": [1, 1], "name": "conv2d_46", "activity_regularizer": null, "activation": "elu", "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_23", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "dtype": "float32", "noise_shape": null, "rate": 0.3, "name": "dropout_23", "seed": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 128, "strides": [1, 1], "name": "conv2d_47", "activity_regularizer": null, "activation": "elu", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 128, "strides": [1, 1], "name": "conv2d_48", "activity_regularizer": null, "activation": "elu", "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "dtype": "float32", "name": "max_pooling2d_24", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "dtype": "float32", "noise_shape": null, "rate": 0.4, "name": "dropout_24", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten_8", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 10, "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_8", "bias_regularizer": null}}], "name": "sequential_8"}}